***messages***

:STRINGS

IDS_BROWSETITLE                "Selecione a pasta de destino"
IDS_CMDEXTRACTING              "Extraindo %s"
IDS_SKIPPING                   "Ignorando %s"
IDS_UNEXPEOF                   "Final inesperado do arquivo"
IDS_FILEHEADERBROKEN           "O cabeçalho do arquivo \"%s\" está corrompido"
IDS_HEADERBROKEN               "Foi encontrado um cabeçalho corrompido"
IDS_MAINHEADERBROKEN           "O cabeçalho do arquivo principal está corrompido"
IDS_CMTHEADERBROKEN            "O cabeçalho do comentário do arquivo está corrompido"
IDS_CMTBROKEN                  "O comentário do arquivo está corrompido"
IDS_OUTOFMEMORYERROR           "Memória insuficiente"
IDS_UNKNOWNMETHOD              "Método desconhecido em %s"
IDS_CANNOTOPEN                 "Não foi possível abrir %s"
IDS_CANNOTCREATE               "Não foi possível criar %s"
IDS_CANNOTMKDIR                "Não foi possível criar a pasta %s"
IDS_ENCRCRCFAILED              "Erro de soma de verificação no arquivo codificado %s. O arquivo está corrompido ou a senha está errada."
IDS_EXTRCRCFAILED              "Erro de soma de verificação em %s"
IDS_PACKEDDATACRCFAILED        "Erro de soma de verificação nos dados comprimidos em %s"
IDS_WRITEERROR                 "Erro de gravação no arquivo %s."
IDS_READERROR                  "Erro de leitura no arquivo %s"
IDS_CLOSEERROR                 "Erro ao fechar o arquivo"
IDS_CANNOTFINDVOL              "O volume requerido está ausente"
IDS_BADARCHIVE                 "Este arquivo está em formato desconhecido ou danificado"
IDS_EXTRACTING                 "Extraindo de %s"
IDS_ASKNEXTVOLTITLE            "Próximo volume"
IDS_ARCHEADERBROKEN            "O cabeçalho do arquivo está corrompido"
IDS_DONE                       "Fechar"
IDS_ERROR                      "Erro"
IDS_ERRORS                     "Foram encontrados erros ao executar a operação\nAtenção para a informação da janela para maiores detalhes"
IDS_BYTES                      "bytes"
IDS_MODIFIEDON                 "modificado em"
IDS_BADFOLDER                  "pasta não está acessível"
IDS_CREATEERRORS               "Alguns arquivos não puderam ser criados."
IDS_RESTARTHINT                "Você pode tentar repetir a instalação após fechar outros aplicativos e reiniciar o Windows."
IDS_CRCERRORS                  "Alguns arquivos da instalação estão corrompidos.\nFavor fazer a transferência de um novo arquivo para refazer a instalação"
IDS_ALLFILES                   "Todos os arquivos"

; These are two versions of first HTML string. SFX selects an appropriate
; version dynamically, depending on presence of "Setup" command. Note that
; <ul> tag must be present in both strings, this is not a mistake.
IDS_TITLE1                     "<ul><li>Pressione o botão <b>Instalar</b> para iniciar a extração.</li><br><br>"
IDS_TITLE1A                    "<ul><li>Pressione o botão <b>Extrair</b> para iniciar a extração.</li><br><br>"

IDS_TITLE2                     "<li>Use o botão <b>Procurar</b> para selecionar uma pasta de"
IDS_TITLE3                     "destino da árvore de pastas. Também poderá ser inserida"
IDS_TITLE4                     "manualmente.</li><br><br>"
IDS_TITLE5                     "<li>Se a pasta de destino não existir, ela será criada"
IDS_TITLE6                     "automaticamente antes da extração.</li></ul>"
IDS_ARCBROKEN                  "O arquivo está corrompido"
IDS_EXTRFILESTO                "Extraindo arquivos para a pasta %s"
IDS_EXTRFILESTOTEMP            "Extraindo arquivos para pasta temporária"
IDS_EXTRACTBUTTON              "Extrair"
IDS_EXTRACTPROGRESS            "Progresso da extração"
IDS_MAXPATHLIMIT               "O tamanho do nome da pasta e caminho não podem exceder %d caracteres"
IDS_UNKENCMETHOD               "Método de criptografia desconhecido em %s"
IDS_WRONGPASSWORD              "A senha especificada está incorreta."
IDS_WRONGFILEPASSWORD          "Senha incorreta para %s"
IDS_COPYERROR                  "Não foi possível copiar %s para %s."
IDS_CANNOTCREATELNKS           "Não foi possível criar o link simbólico %s"
IDS_CANNOTCREATELNKH           "Não foi possível criar o link principal %s"
IDS_ERRLNKTARGET               "Você precisa descomprimir o link de destino primeiro"
IDS_NEEDADMIN                  "Você precisa executar este arquivo auto-extraível como administrador"
IDS_PAUSE                      "Pausa"
IDS_CONTINUE                   "Continuar"
IDS_SECWARNING                 "Aviso de segurança"
IDS_SECDELDLL                  "Remova %s da pasta %s. Ela é insegura para executar %s até que seja concluída."
IDS_EXTRDICTOUTMEM             "Não há memória suficiente para descompactar o arquivo com dicionário de compactação de %u GB."
IDS_SUGGEST64BIT               "É necessário um módulo autoextraível de 64 bits."
IDS_WARNING                    "Aviso"
IDS_DICTEXCEEDSRAM             "Este arquivo requer mais de %u GB de memória para ser descompactado, o que excede a quantidade de memória instalada e pode resultar em uma extração extremamente lenta ou até mesmo na falta de resposta do sistema."
IDS_DICTSUGGESTCANCEL          "Recomenda-se cancelar a extração. Você deseja tentar extraí-lo mesmo assim?"
IDS_EXTRACTIONCANCELLED        "Extração cancelada"


:DIALOG STARTDLG

SIZE                           "100*100"
CAPTION                        "Arquivo auto-extraível do WinRAR"
IDC_DESTEDITTITLE              "Pasta de &destino"
IDC_CHANGEDIR                  "Pro&curar..."
IDC_PROGRESSBARTITLE           "Progresso da instalação"
IDOK                           "Instalar"
IDCANCEL                       "Cancelar"


:DIALOG REPLACEFILEDLG

SIZE                           "120*100"
CAPTION                        "Confirmar substituição de arquivos"
IDC_OWRFILEEXISTS              "O seguinte arquivo já existe"
IDC_OWRASKREPLACE              "Você gostaria de substituir o arquivo existente"
IDC_OWRQUESTION                "por este aqui?"
IDC_OWRYES                     "&Sim"
IDC_OWRALL                     "Sim Para &Todos"
IDC_OWRRENAME                  "&Renomear"
IDC_OWRNO                      "&Não"
IDC_OWRNOALL                   "Não Para T&odos"
IDC_OWRCANCEL                  "&Cancelar"


:DIALOG RENAMEDLG

SIZE                           "100*100"
CAPTION                        "Renomear"
IDOK                           "OK"
IDCANCEL                       "Cancelar"
IDC_RENAMEFROM                 "Renomear arquivo"
IDC_RENAMETO                   "para"


:DIALOG GETPASSWORD1

SIZE                           "100*100"
CAPTION                        "Digitar senha"
IDC_PASSWORDENTER              "&Digite a senha para o arquivo codificado:"
IDOK                           "OK"
IDCANCEL                       "Cancelar"


:DIALOG LICENSEDLG

SIZE                           "100*100"
CAPTION                        "Licença"
IDOK                           "Aceitar"
IDCANCEL                       "Recusar"


:DIALOG ASKNEXTVOL

SIZE                           "100*100"
CAPTION                        "Próximo volume é exigido"
IDC_NEXTVOLINFO1               "Você precisa ter o seguinte volume para continuar a extração:"
IDC_NEXTVOLFIND                "&Procurar..."
IDC_NEXTVOLINFO2               "Insira o disco com este volume e pressione \"OK\" para tentar novamente ou pressione \"Cancelar\" para suspender a extração"
IDOK                           "OK"
IDCANCEL                       "Cancelar"
